Tekla Open API Reference for Tekla Structures 2025
RebarItem.Delete Method
 Deletes the rebar item from the rebar database.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Delete()
Public Function Delete As Boolean
Return Value
Type: Boolean
True on success
See Also
Reference
RebarItem Class
Tekla.Structures.Catalogs Namespace